<a href="https://colab.research.google.com/github/jonnie763/DATA-Science-601/blob/main/Week_3%2C_Fake_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Assignment Content

Write a Python notebook that generates a file containing the following data:​ ​

Email addresses​. Must have an "@"
Phone numbers​
Home Address​
Person's name​
Year born. Use realistic values.​
Number of kids. Use realistic values.​
Categorical variable: rent or own?​
Annual income. Optional challenge: Use a non-uniform distribution​
Number of speeding tickets in past year. Optional challenge: Use a non-uniform distribution​
The user of your notebook should be able to specify how many entities are to be generated.​ ​

​Do not include the .csv output file in your submission -- the file should be generated dynamically.

Order of columns in CSV is not relevant. ​

See slides in lecture for tips.

1. I took a one column at a time approach, see below.  I WILL DO 100 ROWS and 9 COLUMNS.

In [ ]:
import pandas as pd # Import necessary libraries, I used alot of pandas and random here
import numpy as np
import random 
import string
pd.set_option("max_rows", 5)

In [ ]:
data = np.random.randint(1920,2021,size=100) # Start with years, randomly generate years I thought this range was realistic 
df = pd.DataFrame(data,columns=['Year Born'])
df

    Year Born
0        2000
1        1995
..        ...
98       1944
99       1986

[100 rows x 1 columns]

In [ ]:
data_2 = np.random.randint(0,5,size=100)
df2 = pd.DataFrame(data_2, columns=['Number of Kids']) # Same as before, functionally, but with different range 
df2

    Number of Kids
0                3
1                3
..             ...
98               1
99               1

[100 rows x 1 columns]

In [ ]:
df.join(df2)     # How I do my assignment, generate column, then I check if the column has sensible values, once it does I add to the other columns using "join"
df3=df.join(df2)
df3

    Year Born  Number of Kids
0        2000               3
1        1995               3
..        ...             ...
98       1944               1
99       1986               1

[100 rows x 2 columns]

In [ ]:
import pandas as pd
Ad_df= pd.read_html("https://gist.github.com/HeroicEric/1102788") # I webscraped some fake data to make the data a little more convincing    
Ad_df = Ad_df[0] # Save the variable as GDP_df                    # Have to clean data then add one column at a time 
Ad_df

      0                                      1
0   NaN  777 Brockton Avenue, Abington MA 2351
1   NaN        30 Memorial Drive, Avon MA 2322
..   ..                                    ...
232 NaN     4538 Us Hwy 231, Wetumpka AL 36092
233 NaN      2575 Us Hwy 43, Winfield AL 35594

[234 rows x 2 columns]

In [ ]:
Ad_df.head(100)

df_4=Ad_df.head(100)

df_4=df_4.drop(columns=[0]) # Drop unnecessary columns 

df_4

                                               1
0          777 Brockton Avenue, Abington MA 2351
1                30 Memorial Drive, Avon MA 2322
..                                           ...
98  4765 Commercial Drive, New Hartford NY 13413
99                1201 Rt 300, Newburgh NY 12550

[100 rows x 1 columns]

In [ ]:
df3.join(df_4)
columns_3_df=df3.join(df_4) # Join columns but need to rename column, use join 
columns_3_df

    Year Born  Number of Kids                                             1
0        2000               3         777 Brockton Avenue, Abington MA 2351
1        1995               3               30 Memorial Drive, Avon MA 2322
..        ...             ...                                           ...
98       1944               1  4765 Commercial Drive, New Hartford NY 13413
99       1986               1                1201 Rt 300, Newburgh NY 12550

[100 rows x 3 columns]

In [ ]:
Rename_df= columns_3_df.rename(columns={1: 'Addresses'}) # Rename to Addresses
Rename_df

    Year Born  Number of Kids                                     Addresses
0        2000               3         777 Brockton Avenue, Abington MA 2351
1        1995               3               30 Memorial Drive, Avon MA 2322
..        ...             ...                                           ...
98       1944               1  4765 Commercial Drive, New Hartford NY 13413
99       1986               1                1201 Rt 300, Newburgh NY 12550

[100 rows x 3 columns]

In [ ]:
pd.set_option("max_rows", 5)

Name_df= pd.read_html("https://www.ssa.gov/oact/babynames/decades/century.html") # I webscraped more data this time names 

Name_df = Name_df[0] 

Males_df=Name_df['Males']

Males_df["Name"]

Females_df=Name_df['Females']

Combined_genders=Males_df["Name"].append(Females_df['Name']).reset_index(drop=True) # I did a couple of things, first I seperated male and females names then added them again, I needed to reset the index to use the join function again

Random_Names=Combined_genders.sample(100)                                           # Need only 100, so 100 random 


Random_Names_Cleansed = Random_Names.reset_index(drop=True) # Very important I reset indexes, or "join" won't work 


Random_Names_Cleansed

0       John
1      Randy
       ...
98    Evelyn
99    Johnny
Name: Name, Length: 100, dtype: object

In [ ]:
# There was problem with one of the cells, needed to replace it with realistic name, this came in handy 

Random_Names_Cleansed.replace(to_replace = "Source: 100% sample based on Social Security card application data as of of March 2020. See the limitations of  this data source.", 
                 value ="Jonathan") 

Random_Names_Cleansed_2=Random_Names_Cleansed.replace(to_replace = "Source: 100% sample based on Social Security card application data as of of March 2020. See the limitations of  this data source.", 
                 value ="Jonathan")

In [ ]:
columns_4_df=Rename_df.join(Random_Names_Cleansed_2) # Join again 

columns_4_df

,Year Born,Number of Kids,Addresses,Name
0,2000,3,"777 Brockton Avenue, Abington MA 2351",John
1,1995,3,"30 Memorial Drive, Avon MA 2322",Randy
...,...,...,...,...
98,1944,1,"4765 Commercial Drive, New Hartford NY 13413",Evelyn
99,1986,1,"1201 Rt 300, Newburgh NY 12550",Johnny

In [ ]:
import random # https://www.tutorialspoint.com/generating-random-number-list-in-python

randomlist = [] # Link above helpful, however need to change values 
for i in range(0,100):
    n = random.randint(1111111111,9999999999)
    randomlist.append(n)
print(randomlist[80:]) # I truncated it to reduce the list, conserve space

[9601121425, 6583773039, 6752820287, 5358588987, 2999150128, 5736741815, 1835527553, 3982699166, 4396971229, 7548608941, 9414247384, 1839097090, 1158510587, 1987282752, 7127438463, 2352617431, 3414462580, 7083765906, 8206574383, 2623301705]

In [ ]:
df_random = pd.DataFrame(randomlist,columns=['Phone Numbers']) # Turn values into workable column 

print(df_random)

    Phone Numbers
0      4397552170
1      9608110897
..            ...
98     8206574383
99     2623301705

[100 rows x 1 columns]

In [ ]:
columns_5_df=columns_4_df.join(df_random) # Take previous column and add the cleansed column 

columns_5_df

,Year Born,Number of Kids,Addresses,Name,Phone Numbers
0,2000,3,"777 Brockton Avenue, Abington MA 2351",John,4397552170
1,1995,3,"30 Memorial Drive, Avon MA 2322",Randy,9608110897
...,...,...,...,...,...
98,1944,1,"4765 Commercial Drive, New Hartford NY 13413",Evelyn,8206574383
99,1986,1,"1201 Rt 300, Newburgh NY 12550",Johnny,2623301705

2. Now just do income, email addresses, rent or own, and speeding tickets

In [ ]:
import numpy as np
items = ["Rent", "Own"]

distribution = [0.35, .65] # Accurate List for realism, statistically true, https://www.census.gov/housing/hvs/files/currenthvspress.pdf
num_samples = 2            # Approximate percentages for rent vs own, reflected above (.35=35%, .65=65%)
samples = np.random.choice(items, 100, True, distribution)

print(samples)

['Own' 'Rent' 'Own' 'Own' 'Rent' 'Own' 'Rent' 'Own' 'Own' 'Own' 'Own'
 'Own' 'Own' 'Rent' 'Own' 'Own' 'Own' 'Rent' 'Own' 'Own' 'Own' 'Own' 'Own'
 'Own' 'Own' 'Own' 'Own' 'Rent' 'Rent' 'Own' 'Own' 'Rent' 'Own' 'Own'
 'Own' 'Own' 'Own' 'Own' 'Own' 'Own' 'Own' 'Own' 'Own' 'Own' 'Own' 'Own'
 'Rent' 'Own' 'Rent' 'Own' 'Rent' 'Own' 'Rent' 'Own' 'Rent' 'Rent' 'Own'
 'Own' 'Own' 'Own' 'Rent' 'Own' 'Rent' 'Own' 'Rent' 'Rent' 'Rent' 'Own'
 'Own' 'Own' 'Rent' 'Own' 'Own' 'Own' 'Rent' 'Own' 'Own' 'Own' 'Own' 'Own'
 'Own' 'Rent' 'Own' 'Own' 'Rent' 'Rent' 'Own' 'Own' 'Own' 'Rent' 'Own'
 'Own' 'Own' 'Rent' 'Own' 'Own' 'Own' 'Own' 'Own' 'Rent']

In [ ]:
Rent_df = pd.DataFrame(samples,columns=['Rent or Own'])

print(Rent_df)

   Rent or Own
0          Own
1         Rent
..         ...
98         Own
99        Rent

[100 rows x 1 columns]

In [ ]:
columns_6_df=columns_5_df.join(Rent_df) # Add another column 

columns_6_df

,Year Born,Number of Kids,Addresses,Name,Phone Numbers,Rent or Own
0,2000,3,"777 Brockton Avenue, Abington MA 2351",John,4397552170,Own
1,1995,3,"30 Memorial Drive, Avon MA 2322",Randy,9608110897,Rent
...,...,...,...,...,...,...
98,1944,1,"4765 Commercial Drive, New Hartford NY 13413",Evelyn,8206574383,Own
99,1986,1,"1201 Rt 300, Newburgh NY 12550",Johnny,2623301705,Rent

In [ ]:
                                    # https://www.tutorialspoint.com/generating-random-number-list-in-python
randomlist_2 = []
for i in range(0,100):
    n = random.randint(11111,99999) # Same idea as the random phone number but adjusted range for more "real" values
    randomlist_2.append(n)
print(randomlist_2)

[98691, 65836, 61821, 43828, 70688, 13400, 63787, 99481, 35944, 17353, 12004, 86993, 46501, 54869, 91524, 12072, 36485, 55294, 58560, 65253, 55911, 68517, 97867, 61537, 85068, 81247, 76411, 94928, 34741, 94690, 14509, 64509, 26315, 76476, 96108, 63018, 37903, 49695, 29206, 42643, 62442, 47633, 70991, 66272, 23316, 69374, 25552, 11636, 70511, 27973, 20734, 48907, 60335, 80935, 49227, 48785, 82092, 98294, 19074, 63490, 49101, 85112, 17161, 87020, 61317, 45195, 97434, 71967, 78906, 35615, 69664, 24446, 43787, 63220, 63728, 92933, 52224, 80740, 60308, 77907, 30488, 56335, 43764, 82259, 88889, 88606, 35480, 83366, 27399, 55238, 16080, 73725, 61757, 51659, 75040, 67291, 85184, 85932, 95770, 23790]

In [ ]:
df_random_income = pd.DataFrame(randomlist_2,columns=['Income']) # As long as this goes through, you can then join no data cleansing needed

In [ ]:
columns_7_df=columns_6_df.join(df_random_income ) 

columns_7_df

,Year Born,Number of Kids,Addresses,Name,Phone Numbers,Rent or Own,Income
0,2000,3,"777 Brockton Avenue, Abington MA 2351",John,4397552170,Own,98691
1,1995,3,"30 Memorial Drive, Avon MA 2322",Randy,9608110897,Rent,65836
...,...,...,...,...,...,...,...
98,1944,1,"4765 Commercial Drive, New Hartford NY 13413",Evelyn,8206574383,Own,95770
99,1986,1,"1201 Rt 300, Newburgh NY 12550",Johnny,2623301705,Rent,23790

In [ ]:
import numpy as np
items = [0,1,2,3,4,5]

distribution = [.50,.2,.1,.1,.05,.05] # Played around with the distribution,have no idea what the actual distributon is for speeding tickets  
num_samples = 2                            
samples_2 = np.random.choice(items, 100, True, distribution)

print(samples_2)

[2 1 0 5 0 1 3 2 0 1 0 1 0 1 3 0 0 4 5 3 1 0 0 5 0 0 0 1 3 0 3 0 0 0 0 2 0
 1 0 0 3 0 0 2 0 3 5 3 1 5 2 1 0 0 5 3 0 1 0 1 0 0 5 1 5 2 1 0 0 0 0 0 4 0
 0 3 3 0 4 2 0 0 2 1 1 0 1 0 1 3 2 1 0 0 1 4 0 0 1 0]

In [ ]:
df_random_speeding = pd.DataFrame(samples_2,columns=['Speeding Tickets'])

In [ ]:
columns_8_df=columns_7_df.join(df_random_speeding ) # List looks clean will join 

columns_8_df

,Year Born,Number of Kids,Addresses,Name,Phone Numbers,Rent or Own,Income,Speeding Tickets
0,2000,3,"777 Brockton Avenue, Abington MA 2351",John,4397552170,Own,98691,2
1,1995,3,"30 Memorial Drive, Avon MA 2322",Randy,9608110897,Rent,65836,1
...,...,...,...,...,...,...,...,...
98,1944,1,"4765 Commercial Drive, New Hartford NY 13413",Evelyn,8206574383,Own,95770,1
99,1986,1,"1201 Rt 300, Newburgh NY 12550",Johnny,2623301705,Rent,23790,0

In [ ]:
def random_char(y):    # https://stackoverflow.com/questions/59231343/how-to-make-random-email-generator
       return ''.join(random.choice(string.ascii_letters) for x in range(y))

randomlist_email = []  # The link was very helpful, it looks you generate a function add to a gmail and get a "random" email
for i in range(0,100): # I needed to loop hundred to get hundred though, then append from a empty list 
    n = random_char(7)+"@gmail.com"
    randomlist_email.append(n)
print(randomlist_email[90:]) # Truncate for space

['klrTXRA@gmail.com', 'BHfLmaB@gmail.com', 'pFkUccV@gmail.com', 'iJeUnul@gmail.com', 'gBHQJlf@gmail.com', 'pEFaPvV@gmail.com', 'xocxPmh@gmail.com', 'fTFdlKw@gmail.com', 'dXTyRzD@gmail.com', 'xWzpoGE@gmail.com']

In [ ]:
df_random_email = pd.DataFrame(randomlist_email,columns=['Emails'])

In [ ]:
columns_9_df=columns_8_df.join(df_random_email) # Data is clean join 
columns_9_df

,Year Born,Number of Kids,Addresses,Name,Phone Numbers,Rent or Own,Income,Speeding Tickets,Emails
0,2000,3,"777 Brockton Avenue, Abington MA 2351",John,4397552170,Own,98691,2,EEWmjgF@gmail.com
1,1995,3,"30 Memorial Drive, Avon MA 2322",Randy,9608110897,Rent,65836,1,XdHpJyt@gmail.com
...,...,...,...,...,...,...,...,...,...
98,1944,1,"4765 Commercial Drive, New Hartford NY 13413",Evelyn,8206574383,Own,95770,1,dXTyRzD@gmail.com
99,1986,1,"1201 Rt 300, Newburgh NY 12550",Johnny,2623301705,Rent,23790,0,xWzpoGE@gmail.com

In [ ]:
columns_9_df.to_csv(r'Fake Data Generator') # This csv will show up on your downloads, if you want to look at without csv use pd.set_option("max_rows", 100) on the first cell

100 ROWS and 9 COLUMNS ARE DONE.